Revit 2027 API
BuiltInFailures.DimensionFailures.RadialDimensionCannotProjectToArc Property
 Cannot form radial dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RadialDimensionCannotProjectToArc { get; }
Public Shared ReadOnly Property RadialDimensionCannotProjectToArc As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RadialDimensionCannotProjectToArc {
	FailureDefinitionId^ get ();
}
static member RadialDimensionCannotProjectToArc : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace